Data Cleansing Operations on Data Using pandas

Pandas DataFrame is a data structure that holds data in two dimensions- as rows and columns. We have the following syntax-

    pandas.DataFrame(data, index, columns, dtype, copy)

In [2]:
import pandas as pd

data = {'Elements': ['Oxygen', 'Hydrogen','Silicon', 'Neon'], 'Atomic Weight': [12, 14, 34, 54]}

frame = pd.DataFrame(data, index = ['Element 1', 'Element 2', 'Element 3', 'Element 4'])

frame

           Elements  Atomic Weight
Element 1    Oxygen             12
Element 2  Hydrogen             14
Element 3   Silicon             34
Element 4      Neon             54

c. Series

Pandas Series holds data in one dimension, in a labeled format. The index is the set of axis labels we use.
It has the following syntax-

    pandas.Series(data, index, dtype, copy)

In [5]:
import numpy as np

data = np.array([11,23,35,53,94])
pd.Series(data)

0    11
1    23
2    35
3    53
4    94
dtype: int32

In [6]:
pd.Series(np.array(['a','c','b']))

0    a
1    c
2    b
dtype: object

In [7]:
frame.describe()   # to calculate various results

       Atomic Weight
count       4.000000
mean       28.500000
std        19.689253
min        12.000000
25%        13.500000
50%        24.000000
75%        39.000000
max        54.000000

Python Pandas will depict a missing value as NaN, which is short for Not a Number. 
Simply using the reindex() method will fill in NaN for blank values.

In [25]:
table = pd.DataFrame(np.random.randn(4,3), index = [1,2,4,7], columns = ['A','B','C'])
table

          A         B         C
1  1.107124 -0.874828  0.944627
2  0.329633 -0.731635 -0.696920
4  0.793399 -2.027032  0.435274
7  0.310880 -0.018941  0.104887

In [26]:
table1 = table.reindex([1,2,3,4,5,6,7])
table1

          A         B         C
1  1.107124 -0.874828  0.944627
2  0.329633 -0.731635 -0.696920
3       NaN       NaN       NaN
4  0.793399 -2.027032  0.435274
5       NaN       NaN       NaN
6       NaN       NaN       NaN
7  0.310880 -0.018941  0.104887

a). Dropping Missing Values

You can exclude missing values from your dataset using the dropna() method.

In [27]:
table1.dropna()

          A         B         C
1  1.107124 -0.874828  0.944627
2  0.329633 -0.731635 -0.696920
4  0.793399 -2.027032  0.435274
7  0.310880 -0.018941  0.104887

b. Replacing Missing Values

To replace each NaN we have in the dataset, we can use the replace() method.

In [28]:
from numpy import NaN
table1.replace({NaN:0.00})

          A         B         C
1  1.107124 -0.874828  0.944627
2  0.329633 -0.731635 -0.696920
3  0.000000  0.000000  0.000000
4  0.793399 -2.027032  0.435274
5  0.000000  0.000000  0.000000
6  0.000000  0.000000  0.000000
7  0.310880 -0.018941  0.104887

c. Replacing with a Scalar Value

In [29]:
table2 = table1.fillna(7)
table2

          A         B         C
1  1.107124 -0.874828  0.944627
2  0.329633 -0.731635 -0.696920
3  7.000000  7.000000  7.000000
4  0.793399 -2.027032  0.435274
5  7.000000  7.000000  7.000000
6  7.000000  7.000000  7.000000
7  0.310880 -0.018941  0.104887

Data Cleansing Operations in Python

In [30]:
table1.tail(3)       #Getting last 3 elements

         A         B         C
5      NaN       NaN       NaN
6      NaN       NaN       NaN
7  0.31088 -0.018941  0.104887

a. Renaming Columns

In [43]:
data = {'Elements': ['Oxygen', 'Hydrogen','Silicon', 'Neon'], 'Atomic Weight': [12, 14, 34, 54]}
matrix = pd.DataFrame(data, index = ['Element 1', 'Element 2', 'Element 3', 'Element 4'])
matrix.rename(columns = {'Atomic Number':'Number','Element':'Name'}, inplace=True)
matrix

           Elements  Atomic Weight
Element 1    Oxygen             12
Element 2  Hydrogen             14
Element 3   Silicon             34
Element 4      Neon             54